OpenNuvoton/M55M1BSP/SampleCode/ISP/common/ISP_startup_M55M1_usb.c
    0,                                        /*       Reserved                                         */
    WDT1_IRQHandler,                          /*!<  11 Watchdog Timer 1 Interrupt Handler               */
    WWDT1_IRQHandler,                         /*!<  12 Window Watchdog Timer 1 Interrupt Handler        */
    NPU_IRQHandler,                           /*!<  13 Neural Network Processor Interrupt Handler       */
    EINT0_IRQHandler,                         /*!<  14 External Input 0 Interrupt Handler               */
    EINT1_IRQHandler,                         /*!<  15 External Input 1 Interrupt Handler               */
    EINT2_IRQHandler,                         /*!<  16 External Input 2 Interrupt Handler               */
    EINT3_IRQHandler,                         /*!<  17 External Input 3 Interrupt Handler               */
    EINT4_IRQHandler,                         /*!<  18 External Input 4 Interrupt Handler               */
    EINT5_IRQHandler,                         /*!<  19 External Input 5 Interrupt Handler               */

    GPA_IRQHandler,                           /*!<  20 GPIO Port A Interrupt Handler                    */
    GPB_IRQHandler,                           /*!<  21 GPIO Port B Interrupt Handler                    */
    GPC_IRQHandler,                           /*!<  22 GPIO Port C Interrupt Handler                    */
    GPD_IRQHandler,                           /*!<  23 GPIO Port D Interrupt Handler                    */
    GPE_IRQHandler,                           /*!<  24 GPIO Port E Interrupt Handler                    */
    GPF_IRQHandler,                           /*!<  25 GPIO Port F Interrupt Handler                    */
    GPG_IRQHandler,                           /*!<  26 GPIO Port G Interrupt Handler                    */
    GPH_IRQHandler,                           /*!<  27 GPIO Port H Interrupt Handler                    */
    GPI_IRQHandler,                           /*!<  28 GPIO Port I Interrupt Handler                    */
    GPJ_IRQHandler,                           /*!<  29 GPIO Port J Interrupt Handler                    */

    BRAKE0_IRQHandler,                        /*!<  30 EPWM0 Brake Interrupt Handler                    */
    EPWM0P0_IRQHandler,                       /*!<  31 EPWM0 Pair 0 Interrupt Handler                   */
    EPWM0P1_IRQHandler,                       /*!<  32 EPWM0 Pair 1 Interrupt Handler                   */
    EPWM0P2_IRQHandler,                       /*!<  33 EPWM0 Pair 2 Interrupt Handler                   */
    BRAKE1_IRQHandler,                        /*!<  34 EPWM1 Brake Interrupt Handler                    */
    EPWM1P0_IRQHandler,                       /*!<  35 EPWM1 Pair 0 Interrupt Handler                   */
    EPWM1P1_IRQHandler,                       /*!<  36 EPWM1 Pair 1 Interrupt Handler                   */
    EPWM1P2_IRQHandler,                       /*!<  37 EPWM1 Pair 2 Interrupt Handler                   */
    BPWM0_IRQHandler,                         /*!<  38 BPWM0 Interrupt Handler                          */
    BPWM1_IRQHandler,                         /*!<  39 BPWM1 Interrupt Handler                          */

    0,                                        /*!<     Reserved                                         */
    PDMA0_IRQHandler,                         /*!<  41 PDMA0 Interrupt Handler                          */
    PDMA1_IRQHandler,                         /*!<  42 PDMA1 Interrupt Handler                          */
    LPPDMA_IRQHandler,                        /*!<  43 Low Power PDMA Interrupt Handler                 */
    SCU_IRQHandler,                           /*!<  44 SCU Interrupt Handler                            */
    0,                                        /*!<     Reserved                                         */
    KS_IRQHandler,                            /*!<  46 Key Store Interrupt Handler                      */
    TIMER0_IRQHandler,                        /*!<  47 Timer0 Interrupt Handler                         */
    TIMER1_IRQHandler,                        /*!<  48 Timer1 Interrupt Handler                         */
    TIMER2_IRQHandler,                        /*!<  49 Timer2 Interrupt Handler                         */

    TIMER3_IRQHandler,                        /*!<  50 Timer3 Interrupt Handler                         */
    LPTMR0_IRQHandler,                        /*!<  51 Low Power Timer 0 Interrupt Handler              */
    LPTMR1_IRQHandler,                        /*!<  52 Low Power Timer 1 Interrupt Handler              */
    0,                                        /*!<     Reserved                                         */
    TTMR0_IRQHandler,                         /*!<  54 Tick Timer 0 Interrupt Handler                   */
    TTMR1_IRQHandler,                         /*!<  55 Tick Timer 1 Interrupt Handler                   */
    USBH0_IRQHandler,                         /*!<  56 USB Host 0 Interrupt Handler                     */
    USBH1_IRQHandler,                         /*!<  57 USB Host 1 Interrupt Handler                     */
    USBD_IRQHandler,                          /*!<  58 USB Device Interrupt Handler                     */
    USBOTG_IRQHandler,                        /*!<  59 USB OTG Interrupt Handler                        */

    HSUSBH_IRQHandler,                        /*!<  60 High Speed USB Host Interrupt Handler            */
    HSUSBD_IRQHandler,                        /*!<  61 High Speed USB Device Interrupt Handler          */
    HSOTG_IRQHandler,                         /*!<  62 High Speed OTG Interrupt Handler                 */
};

#if defined ( __GNUC__ )
    #pragma GCC diagnostic pop
#endif


/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
    // Copy __set_PSP/__set_MSPLIM/__set_PSPLIM from cmsis_armclang.h
    __ASM volatile("MSR psp, %0" : : "r"((uint32_t)(&__INITIAL_SP)) :);
    __ASM volatile("MSR msplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));
    __ASM volatile("MSR psplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));

    // Move other code to Reset_Handler_Main to prevent compiler generate stack access code.
    // Move stack pointer before setting MSPLIM might cause hard fault due to MSPLIM violation.
    Reset_Handler_Main();
}

__NO_RETURN void Reset_Handler_Main(void)
{
#if 0   // To reduce code size

