OpenNuvoton/M55M1BSP/SampleCode/ISP/common/ISP_startup_M55M1_usb.c
    if ((__PC() & NS_OFFSET) == 0)
    {
        // Unlock protected registers
        do
        {
            SYS->REGLCTL = 0x59UL;
            SYS->REGLCTL = 0x16UL;
            SYS->REGLCTL = 0x88UL;
        } while (SYS->REGLCTL == 0UL);

        // Switch SRAM0 to normal power mode
        if (PMC->SYSRB0PC != 0)
        {
            PMC->SYSRB0PC = 0;

            while (PMC->SYSRB0PC & PMC_SYSRB0PC_PCBUSY_Msk)
                ;
        }

        // Enable SRAM0 clock
        CLK->SRAMCTL |= CLK_SRAMCTL_SRAM0CKEN_Msk;

        // Switch SRAM1 to normal power mode
        if (PMC->SYSRB1PC != 0)
        {
            PMC->SYSRB1PC = 0;

            while (PMC->SYSRB1PC & PMC_SYSRB1PC_PCBUSY_Msk)
                ;
        }

        // Enable SRAM1 clock
        CLK->SRAMCTL |= CLK_SRAMCTL_SRAM1CKEN_Msk;
    }

#endif
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __TZ_set_STACKSEAL_S((uint32_t *)(&__STACK_SEAL));
#endif

#if 0   // To reduce code size
    SCB_InvalidateICache();
    SCB_EnableICache();
#endif

#if (NVT_DCACHE_ON == 1)
    SCB_InvalidateDCache();
    SCB_EnableDCache();
#endif  // (NVT_DCACHE_ON == 1)

    __PROGRAM_START();      // Enter PreMain (C library entry point)
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
    #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif


/*----------------------------------------------------------------------------
  Hard Fault Handler
 *----------------------------------------------------------------------------*/
void HardFault_Handler(void)
{
    while (1) ;
}

/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
    while (1) ;
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
#endif

/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/
